app/views/articles/index.html.erb

          <td><%= article.link %></td>
          <td><%= article.comments.count %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 14]]