app/views/articles/show.html.erb

        <a href="<%= @article.link %>" class="btn btn-sm btn-outline-primary">Link</a>
        <h5 class="text-muted"><%= @article.comments.count %> comments</h5>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 15]]