app/controllers/articles_controller.rb

  def index
    @articles = Article.all.order('created_at DESC')
    if !user_signed_in?
      @articles = @articles.limit(10)
---
SELECT "articles".* FROM "articles" ORDER BY created_at DESC
SELECT  "articles".* FROM "articles" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 10]]

  def create
    @article = current_user.articles.build(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "summary", "body", "link", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "asdasd"], ["summary", "asdasd"], ["body", "asdasd"], ["link", "asdasd"], ["created_at", "2018-03-19 13:16:58.430745"], ["updated_at", "2018-03-19 13:16:58.430745"], ["user_id", 1]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = $1, "summary" = $2, "body" = $3, "updated_at" = $4 WHERE "articles"."id" = $5  [["title", "Subtítulo noticia 23"], ["summary", "Nuevo subtítulo 23"], ["body", "Cuerpo de la noticia 23"], ["updated_at", "2018-04-03 17:37:38.067156"], ["id", 23]]