app/controllers/comments_controller.rb

  def create
    #@comment = @article.comments.new(comment_params)
    #if @comment.save
    #  redirect_to @article
    #else
    #  flash.alert = "Not created. Fields can't be blank."
    #end
    @article.comments.create!(comment_params)
---
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "yo"], ["body", "hola"], ["article_id", 2], ["created_at", "2018-03-19 12:30:59.163303"], ["updated_at", "2018-03-19 12:30:59.163303"]]

  def update
    @comment.update(comment_params)
---
UPDATE "comments" SET "commenter" = $1, "body" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["commenter", "postman 6.2"], ["body", "postman comment test 6.2"], ["updated_at", "2018-04-03 14:16:10.182836"], ["id", 26]]

  def destroy
    #@comment = @article.comments.find(params[:id])
    #@comment.destroy
    #redirect_to article_path(@article)
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]

    def find_article
      @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

    def set_article_comment
      @comment = @article.comments.find_by!(id: params[:id]) if @article
---
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["article_id", 24], ["id", 25], ["LIMIT", 1]]