app/controllers/welcome_controller.rb

  def index
    @articles = Article.all.order('created_at DESC').limit(10)
---
SELECT  "articles".* FROM "articles" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 10]]